from telebot import *
from telebot import types

# BOT_TOKEN
bot = telebot.TeleBot('8402644751:AAG8mxcgO5WWbMa_K8blBnUseSnWuxct-VE')


# Buttons days of the week
def create_days_keyboard():
    markup = types.ReplyKeyboardMarkup(
        resize_keyboard=True)  # ReplyKeyboardMarkup — класс, который позволяет создавать reply-кнопки для шаблонных ответов в чат-ботах для Telegram.
    # resize_keyboard=True - кнопки делает красивенько в тг
    monday = types.KeyboardButton('Понедельник')
    tuesday = types.KeyboardButton('Вторник')
    wednesday = types.KeyboardButton('Среда')
    thursday = types.KeyboardButton('Четверг')
    friday = types.KeyboardButton('Пятница')
    saturday = types.KeyboardButton('Суббота')
    markup.add(monday, tuesday, wednesday, thursday, friday, saturday)
    return markup


def create_back_keyboard():  # Cоздаем в этот же класс кнопку 'назад'
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    back_button = types.KeyboardButton("Назад")
    markup.add(back_button)
    return markup


@bot.message_handler(commands=['start'])  # Command </start> handler
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    gift_shedule = types.KeyboardButton('Получить расписание')
    markup.add(gift_shedule)
    bot.send_message(message.chat.id, 'Привет, Даша, выбери действие:', reply_markup=markup)


@bot.message_handler(func=lambda message: message.text == "Получить расписание")
def handler_schedule_button(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    chislitel_shedule = types.KeyboardButton('Числитель')
    znamenatel_shedule = types.KeyboardButton('Знаменатель')
    markup.add(chislitel_shedule, znamenatel_shedule)
    bot.send_message(message.chat.id, 'Выбери название недели', reply_markup=markup)


# Это декоратор, который определяет условие обработки сообщения
# func=lambda message: - используется лямбда-функция для проверки условия
# message.text == "Получить расписание" - проверка, что текст сообщения точно равен строке “Получить расписание”
# Бот будет выполнять эту функцию только когда пользователь отправит именно эту фразу
@bot.message_handler(func=lambda message: message.text == "Числитель" or message.text == "Знаменатель")
def handle_schedule_button(message):
    markup = create_days_keyboard()
    bot.send_message(message.chat.id, 'Выбери день недели', reply_markup=markup)


@bot.message_handler(
    func=lambda message: message.text in ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'])
def handle_day_schedule(message):
    day = message.text
    markup = create_back_keyboard()

    if day == "Понедельник":
        schedule_text = (
            "📅 <b>Расписание на понедельник:</b>\n\n"
            "🕒 <b>8:00 - 9:35</b>\n\n  📖 Первый иностранный язык к.ф.н.Панкова Т.Н.(англ)ауд.215к.ф.н.БорисоваЛ.М.(нем) <b>ауд.214</b>\n"
            "────────────────────\n"
            "🕒 <b>9:45 - 11:20</b>\n\n 📖 Первый иностранный язык к.ф.н.Панкова Т.Н.(англ)ауд.215к.ф.н.БорисоваЛ.М.(нем) <b>ауд.214</b>\n"
            "────────────────────\n"
            "🕒 <b>11:30 - 13:05</b>\n\n  📖 Первый иностранный язык к.ф.н.Панкова Т.Н.(англ)ауд.215к.ф.н.БорисоваЛ.М.(нем) <b>ауд.214</b>\n"
            "────────────────────\n"
            "🕒<b>13:25 - 15:00</b>\n 📖 История России - лекция. к.и.н Дудина О.В. ауд"
            "────────────────────\n"
        )

    elif day == "Вторник":
        schedule_text = (
            "📅 <b>Расписание на вторник:</b>\n\n"
            "🕒 <b>8:00 - 9:35</b>\n\n  📖 Первый иностранный язык к.ф.н.Панкова Т.Н.(англ)ауд.215к.ф.н.БорисоваЛ.М.(нем) <b>ауд.214</b>\n"
            "────────────────────\n"
            "🕒 <b>9:45 - 11:20</b>\n\n 📖 Первый иностранный язык к.ф.н.Панкова Т.Н.(англ)ауд.215к.ф.н.БорисоваЛ.М.(нем) <b>ауд.214</b>\n"
            "────────────────────\n"
            "🕒 <b>11:30 - 13:05</b>\n\n  📖 Первый иностранный язык к.ф.н.Панкова Т.Н.(англ)ауд.215к.ф.н.БорисоваЛ.М.(нем) <b>ауд.214</b>\n"
            "────────────────────\n"
            "🕒 <b>13:25 - 15:00</b>\n\n 📖 Физическая культура и спорт\n"
            "────────────────────\n"
        )

    elif day == "Среда":
        schedule_text = (
            "📅 <b>Расписание на среду:</b>\n\n"
            "🕒 <b>8:00 - 9:35</b>\n\n  📖 Психология личности и ее саморазвития - лекция. Преп. Чистякова Е.А. <b>ауд.221П</b>\n"
            "────────────────────\n"
            "🕒 <b>9:45 - 11:20</b>\n\n 📖 Введение в зарубежное регионоведение - практика. д.и.н. Кирчанов М.В. <b>ауд.224П</b>\n"
            "────────────────────\n"
            "🕒 <b>11:30 - 13:05</b>\n\n    📖 Психология личности и ее саморазвития - лекция. Преп. Чистякова Е.А. <b>ауд.221П</b>\n"
            "────────────────────\n"
            "🕒 <b>13:25 - 15:00</b>\n\n  📖 Безопасность жизнедеятельности - лекция. Хорошилова Е.И. <b>ауд.43</b>(Никитинская, 14б)\n"
            "────────────────────\n"
        )

    elif day == "Четверг":
        schedule_text = (
            "📅 <b>Расписание на четверг:</b>\n\n"
            "🕒 <b>8:00 - 9:35</b>\n\n  📖 Нет пары\n"
            "────────────────────\n"
            "🕒 <b>9:45 - 11:20</b>\n\n 📖 Нет пары\n"
            "────────────────────\n"
            "🕒 <b>11:30 - 13:05</b>\n\n    📖 Нет пары\n"
            "────────────────────\n"
            "🕒 <b>13:25 - 15:00</b>\n\n  📖 Культура Евразийского региона - лекция к.и.н Якушкина Е.И. <b>ауд.224П</b>\n"
            "────────────────────\n"
        )

    elif day == "Пятница":
        schedule_text = (
            "📅 <b>Расписание на пятницу:</b>\n\n"
            "🕒 <b>8:00 - 9:35</b>\n\n  📖 Нет пары\n"
            "────────────────────\n"
            "🕒 <b>9:45 - 11:20</b>\n\n 📖 Нет пары\n"
            "────────────────────\n"
            "🕒 <b>11:30 - 13:05</b>\n\n    📖 Основы права и противодействие противоправному пооведению - лекция. Тюнина И.И. <b>ауд.221П</b>\n"
            "────────────────────\n"
            "🕒 <b>13:25 - 15:00</b>\n\n  📖 Основы Российской государственности. Савенков Р.В. <b>ауд.221П</b>\n"
            "────────────────────\n"

        )

    elif day == "Суббота":
        schedule_text = (
            "📅 <b>Расписание на субботу:</b>\n\n"
            "🕒 <b>8:00 - 9:35</b>\n\n  📖 Нет пары\n"
            "────────────────────\n"
            "🕒 <b>9:45 - 11:20</b>\n\n 📖 Социально-политическая география евразийских стран - лекция Комов.И.В. <b>ауд.221П</b>\n"
            "────────────────────\n"
            "🕒 <b>11:30 - 13:05</b>\n\n    📖 Основы права и противодействие противоправному пооведению - лекция. Тюнина И.И. <b>ауд.235П</b>\n"
            "────────────────────\n"
        )

    bot.send_message(message.chat.id, schedule_text, reply_markup=markup, parse_mode='HTML')


@bot.message_handler(func=lambda message: message.text == "Назад")
def handle_back(message):
    markup = create_days_keyboard()
    bot.send_message(message.chat.id, 'Выбери день недели', reply_markup=markup)

# Запуск бота
bot.polling(none_stop=True)
